modules/org/freemacs-calfw.org
# -*-eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t);-*-

#+title: Calfw Configuration
#+author: Thomas Freeman
#+date: Time-stamp: <2024-10-26 21:07:45 thomas>
#+language: en_US
#+property: header-args :results silent :exports code

#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t num:nil toc:t
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+keywords: Emacs
#+html_link_home: ../../index.html
#+html_link_up: ../../init.html
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)
#+html_head: <style>#org-div-home-and-up { text-align: right; padding-right: 10pt; }</style>

-----


* Install Calfw

[[https://github.com/kiwanami/emacs-calfw][Calfw]] provides a grid-based calendar view similar to what is seen in most graphical calendar programs but integrates the org agenda files. I use the fork from @zemaye as this version has fixed the issue in ~calfw-org.el~ where events that span multiple dates show up repeated on the display.

#+begin_src emacs-lisp :tangle yes :comments both
  (use-package calfw
    :straight (emacs-calfw :host github
                           :repo "zemaye/emacs-calfw"
                           :branch "master")
    :commands (cfw:open-calendar-buffer)
    :init
    (defalias 'calfw 'cfw:open-calendar-buffer)
    :custom
    (cfw:fchar-junction ?╋)
    (cfw:fchar-vertical-line ?┃)
    (cfw:fchar-horizontal-line ?━)
    (cfw:fchar-left-junction ?┣)
    (cfw:fchar-right-junction ?┫)
    (cfw:fchar-top-junction ?┯)
    (cfw:fchar-top-left-corner ?┏)
    (cfw:fchar-top-right-corner ?┓))
#+end_src

* Calfw Org

~calfw-org.el~  displays org-mode events in the ~calfw~ calendar. I don't like the long command ~M-x cfw:open-org-calendar~ so I have shortened to it to ~M-x calfworg~ which is much easier to type and remember.

#+begin_src emacs-lisp :tangle yes :comments both
  (use-package calfw-org
    :straight (emacs-calfw :host github
                           :repo "zemaye/emacs-calfw"
                           :branch "master")
    :commands (cfw:open-org-calendar)
    :init
    (defalias 'calfworg 'cfw:open-org-calendar))
#+END_SRC

* End

Tell Emacs what package this file provides.

#+begin_src emacs-lisp :tangle yes
  (provide 'freemacs-calfw)

  ;;; freemacs-calfw.el ends here.
#+end_src
